Tekla Open API Reference for Tekla Structures 2025
ConicalSurfaceNode.Surface Property
 Gets the conical surface geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConicalSurface Surface { get; }
Public ReadOnly Property Surface As ConicalSurface
	Get
Property Value
Type: ConicalSurface
See Also
Reference
ConicalSurfaceNode Class
Tekla.Structures.Model Namespace